# Python

In [ ]:
1.Mutable/Immutable Python Data Types
# -Write a function that takes a list and a tuple, attempts to modify both, and returns the results
 (подсказки: 
	- кортежи - неизмеяемы, листы - изменяемы
	- вспомни конструкцию try/except
#########################################################################################################
#Ниже пример тестов:																					#
#-> modify_data_types - название функции, ты можешь использовать любое									#
#-> [1, 2, 3], (4, 5, 6) -> 2 аргумента, которые принимает функция										#
#-> после '==' ([1, 2, 3, 100], (4, 5, 6)) результат, которые ожидается после выполнения функции 		#
#########################################################################################################
assert modify_data_types([1, 2, 3], (4, 5, 6)) == ([1, 2, 3, 100], (4, 5, 6))
assert modify_data_types([], (0,)) == ([100], (0,))

In [ ]:
try

In [ ]:
-------------------------------2. second task Loops (For/While)----------------------------------
- Write a function that prints only odds(нечетные) numbers from 1 to n inclusive. (n - user's input in console)
(
подсказки -> вспомни про функцию input() для прочтения данных с при вводе
)

assert loop_for(10) == [1, 3, 5, 7, 9]
assert loop_while(15) == [1, 3, 5, 7, 9, 11, 13, 15]

In [16]:

def odds_numbers(a):
    
    empty = []

    for i in range(1, a + 1):
        if i % 2 == 0:
            continue
        else:
            empty.append(i)
    
    return empty 

# odds_numbers(10)  
odds_numbers(15)

[1, 3, 5, 7, 9, 11, 13, 15]

In [ ]:
-------------------------------3.with Statement (File Handling)----------------------------------
 Write a function that adds the string "hello world" 10 times to a new file, each on a new line.
 function params -> file_name
 ( hints/подсказки 
 you can use construction open()/close or with()
 начало функции может быть таким def write_hello_world(file_path)

In [41]:
def write_hello_world(b :str):
    
    text_file = open("new_file.txt", "w")
    a = (b  + "\n") * 10
    text_file.write(a)
    
write_hello_world('НАША ЗАДАЧА ЭТО РАЗНЫМИ СХЕМАМИ ОБМАНУТЬ')

In [ ]:
-------------------------------4.Recursion----------------------------------
1. Write a recursive function to calculate the factorial of a number 
2. Write a recursive function to calculate Fibonacci Sequence
(Not mandatory!also you can try to do it using loops>Not mandatory!<)

1. {
	assert factorial(0) == 1
	assert factorial(5) == 120
}
2. {
	assert fibonacci_loop(1) == [0]
	assert fibonacci_loop(5) == [0, 1, 1, 2, 3]
	assert fibonacci_loop(10) == [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [2]:
1. 

# def get_factorial(n):
#     if n == 1:
#         return 1
#     else:
#         return n * get_factorial(n - 1)
    
# get_factorial(5)

120

In [1]:
# 2. 

# def get_fib(n):
#     if n < 2:
#         return n 
#     return get_fib(n - 1) + get_fib(n - 2)

# get_fib(6)

8

In [ ]:
-------------------------------5.Decorators----------------------------------
1. Write a decorator that times how long a function takes to execute.
2. Write a decorator that prints something before and after the function runs.
3. Write a decorator that multiplies a function's return value by 10.

example of 3. task {
		@multiply_by_10_decorator # try to remeber how to do it / you need only to create this  @multiply_by_10_decorator
		def sample_func(x):
			return x

		# Test case
		assert sample_func(5) == 50
		assert sample_func(10) == 100
		assert sample_func(20) == 200
}

In [ ]:
1.

import time

def decoration(func):
    def wrapper():
        start = time.time()
        func()
        end = time.time()
        final = end - start
        print(final)
    return wrapper

@decoration
def timix():
    return print(5 ** 123456)
    
timix()

In [ ]:
2.

def my_decorator(func):
    def wrapper():
        print('ГАУ - это гей')
        func()
        print('аузе биг!')
    return wrapper

@my_decorator
def print_hello():
    print('Hello!')
    
print_hello()

In [ ]:
3.

def decor(func):
    def wrapper(a, b):
        a = func(a, b)
        a *=  10
        return a
    return wrapper

@decor
def multiplay(a, b):
    return a * b

multiplay(6, 7)

In [ ]:
-------------------------------6. Working with APIs (HTTP Requests)----------------------------------
1.Write a function that fetches data from url below and returns it as JSON/Dictionary
url=https://jsonplaceholder.typicode.com/todos/1

tests: assert isinstance(data, dict)
	   assert data['id'] == 1

2. (3 steps task )
	   -Write a function that fetches data from url below and returns it as JSON/dict.
       -Create a Pandas DF with 4 columns based on JSON/dict. 
	   -save DF as a CVS file using gzip compression, ignoring indexes, filename 'danila_api_test_{current_date}.csv.gz'
   
url=https://jsonplaceholder.typicode.com/todos/

In [9]:
import requests
import json
import gzip
import shutil
from datetime import datetime

url = "https://jsonplaceholder.typicode.com/todos/1"
response = requests.get(url)

body_dict = response.json()

df = pd.DataFrame.from_dict(body_dict, orient  = 'index')

df_transposed = df.T # разворачиваем дф транспонированием
df_transposed

  userId id               title completed
0      1  1  delectus aut autem     False

In [11]:
current_date = datetime.now().strftime('%Y-%m-%d')

current_date

'2024-09-09'

In [12]:
file_name = f'danila_api_test_{current_date}.csv.gz'

In [13]:
df_transposed.to_csv(file_name, compression='gzip', index = 'False')

In [ ]:
-------------------------------7.(Read about HTTP requests)----------------------------------
what is it? what types exist? how do they differ?

# Pandas

In [ ]:
1. Task: Read a CSV from a URL and calculate the average of a specific column.

import pandas as pd

def calculate_average(url, column_name):
    pass

# Test case
url = "https://people.sc.fsu.edu/~jburkardt/data/csv/hw_200.csv"
assert round(calculate_average(url, "Height(Inches)"), 2) == 67.99

In [4]:
import pandas as pd

df = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/hw_200.csv')

df.columns.values.tolist ()

df[' Height(Inches)"'].mean()

67.94979999999998

In [7]:
import pandas as pd

def count_avg(url, column_name):
    df = pd.read_csv(url)
    return df[column_name].mean()

url = "https://people.sc.fsu.edu/~jburkardt/data/csv/hw_200.csv"
column_name = ' Height(Inches)"'

count_avg(url,  column_name)

67.94979999999998

In [ ]:
2. Task: Read JSON data from a URL and group by a specific field, calculating the sum of another field.
def group_and_sum(url, group_by_col, sum_col):
    pass

# Test case
url = "https://jsonplaceholder.typicode.com/todos"
assert group_and_sum(url, "userId", "id") == {1: 55, 2: 55, 3: 55, 4: 55, 5: 55, 6: 45, 7: 35, 8: 40, 9: 45, 10: 45}

In [4]:
import pandas as pd

df2 = pd.read_json('https://jsonplaceholder.typicode.com/todos')

df2

     userId   id                                              title  completed
0         1    1                                 delectus aut autem      False
1         1    2                 quis ut nam facilis et officia qui      False
2         1    3                                fugiat veniam minus      False
3         1    4                                   et porro tempora       True
4         1    5  laboriosam mollitia et enim quasi adipisci qui...      False
..      ...  ...                                                ...        ...
195      10  196                consequuntur aut ut fugit similique       True
196      10  197                  dignissimos quo nobis earum saepe       True
197      10  198                       quis eius est sint explicabo       True
198      10  199                       numquam repellendus a magnam       True
199      10  200                       ipsam aperiam voluptates qui      False

[200 rows x 4 columns]

In [31]:
df_new = df2.groupby('userId')['id'].sum().reset_index()



df_new

   userId    id
0       1   210
1       2   610
2       3  1010
3       4  1410
4       5  1810
5       6  2210
6       7  2610
7       8  3010
8       9  3410
9      10  3810

In [30]:
aa = df_new[['userId','id']].to_dict()

aa

{'userId': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10},
 'id': {0: 210,
  1: 610,
  2: 1010,
  3: 1410,
  4: 1810,
  5: 2210,
  6: 2610,
  7: 3010,
  8: 3410,
  9: 3810}}

In [ ]:
3.  Task: Merge two dictionaries into a DataFrame, perform aggregation (mean), and filter out rows where a specific column is above a threshold.
def merge_and_filter(dict1, dict2, col1, col2, threshold):
    pass

# Test case
dict1 = {'id': [1, 2, 3, 4], 'value': [10, 15, 20, 25]}
dict2 = {'id': [1, 2, 3, 4], 'score': [5, 10, 15, 20]}
assert merge_and_filter(dict1, dict2, 'value', 'score', 15).equals(pd.DataFrame({'id': [3, 4], 'value': [20, 25], 'score': [15, 20]}))

In [7]:
import pandas as pd

dict1 = {'id': [1, 2, 3, 4], 'value': [10, 15, 20, 25]}
dict2 = {'id': [1, 2, 3, 4], 'score': [5, 10, 15, 20]}

a = pd.DataFrame.from_dict(dict1)
b = pd.DataFrame.from_dict(dict2)
n = 15
a

   id  value
0   1     10
1   2     15
2   3     20
3   4     25

In [8]:
b

   id  score
0   1      5
1   2     10
2   3     15
3   4     20

In [9]:
d = a.merge(b, on = 'id', how = 'left')
d

   id  value  score
0   1     10      5
1   2     15     10
2   3     20     15
3   4     25     20

In [12]:
e = d[(d['value'] > n) | (d['score'] > n) ]
e

   id  value  score
2   3     20     15
3   4     25     20

In [ ]:
4. Task: Read a JSON file, group by one column, and calculate the count for each group.
def group_and_count(url, group_by_col):
    pass

# Test case
url = "https://jsonplaceholder.typicode.com/todos"
assert group_and_count(url, "completed") == {False: 120, True: 80}

In [17]:
import pandas as pd

df = pd.read_json('https://jsonplaceholder.typicode.com/todos')

df

     userId   id                                              title  completed
0         1    1                                 delectus aut autem      False
1         1    2                 quis ut nam facilis et officia qui      False
2         1    3                                fugiat veniam minus      False
3         1    4                                   et porro tempora       True
4         1    5  laboriosam mollitia et enim quasi adipisci qui...      False
..      ...  ...                                                ...        ...
195      10  196                consequuntur aut ut fugit similique       True
196      10  197                  dignissimos quo nobis earum saepe       True
197      10  198                       quis eius est sint explicabo       True
198      10  199                       numquam repellendus a magnam       True
199      10  200                       ipsam aperiam voluptates qui      False

[200 rows x 4 columns]

In [18]:
df = df['completed'].value_counts()

result = df.to_dict()

result

{False: 110, True: 90}

In [ ]:
5.  Task: Perform a pivot table operation on a DataFrame generated from a dictionary.
def pivot_table_from_dict(data, index, columns, values, aggfunc):
    pass

# Test case
data = {'Region': ['North', 'South', 'North', 'South'], 'Product': ['A', 'A', 'B', 'B'], 'Sales': [100, 200, 150, 300]}
assert pivot_table_from_dict(data, 'Region', 'Product', 'Sales', 'sum').equals(pd.DataFrame({'A': [100, 200], 'B': [150, 300]}, index=['North', 'South']))

In [46]:
import pandas as pd
import numpy as np

data = {'Region': ['North', 'South', 'North', 'South'], 'Product': ['A', 'A', 'B', 'B'], 'Sales': [100, 200, 150, 300]}

df = pd.DataFrame.from_dict(data)

df

  Region Product  Sales
0  North       A    100
1  South       A    200
2  North       B    150
3  South       B    300

In [56]:
dfpivoted = df.pivot_table(index = ['Region'], columns = ['Product'])
dfpivoted

        Sales
Product     A    B
Region
North     100  150
South     200  300

In [ ]:
6. Task: Read a CSV from url, make all column's values in lower case, drop duplicates and rows where are blank/null values, and save it to a new CSV.
url = "https://people.sc.fsu.edu/~jburkardt/data/csv/addresses.csv"

In [21]:
import pandas as pd

df = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/addresses.csv')

,John,Doe,120 jefferson st.,Riverside,NJ,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [22]:
df = df.rename(columns = lambda col : col.lower())

,john,doe,120 jefferson st.,riverside,nj,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [24]:
df = df.drop_duplicates()
df = df.dropna()

,john,doe,120 jefferson st.,riverside,nj,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123

In [25]:
df.to_csv('555.csv')

In [ ]:
7.Task: Load data from a dictionary, create a new column based on a condition, and return the DataFrame.
		Condition -> if age < 20, new column should have False, else True 
def create_new_column(data, condition_col, new_col_name):
    pass

# Test case
data = {'Age': [18, 22, 30, 45], 'Name': ['Alice', 'Bob', 'Charlie', 'David']}
assert create_new_column(data, 'Age', 'Adult').equals(pd.DataFrame({'Age': [18, 22, 30, 45], 'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Adult': [False, True, True, True]}))

In [27]:
import pandas as pd 

data = {'Age': [18, 22, 30, 45], 'Name': ['Alice', 'Bob', 'Charlie', 'David']}

df = pd.DataFrame.from_dict(data)

   Age     Name
0   18    Alice
1   22      Bob
2   30  Charlie
3   45    David

In [30]:
def decide_value(row):
    if row['Age'] <= 18:
        val = False
    else:
        val = True
    return val

In [31]:

df['False/True'] = df.apply(decide_value, axis = 1)

df

   Age     Name  False/True
0   18    Alice       False
1   22      Bob        True
2   30  Charlie        True
3   45    David        True